#ifndef _BATON_TEXTURE_H_
#define _BATON_TEXTURE_H_
//=============================================================================
//
// 警棒アイコンのテクスチャヘッダー [baton_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CBatonTexture : public CScene2D
{
public:
	CBatonTexture(PRIORITY Priority = PRIORITY_UI);					// コンストラクタ
	~CBatonTexture();												// デストラクタ
	static CBatonTexture * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT Init(D3DXVECTOR3 pos,D3DXVECTOR3 size);					// 初期化処理
	void Uninit(void);												// 終了処理
	void Update(void);												// プレイヤーの制御
	void Draw(void);												// 描画処理
private:
};
#endif
