#ifndef _BLACK_TEXTURE_H_
#define _BLACK_TEXTURE_H_
//=============================================================================
//
// 黒背景のテクスチャヘッダー [black_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CBlackTexture : public CScene2D
{
public:
	CBlackTexture(PRIORITY Priority = PRIORITY_0);					// コンストラクタ
	~CBlackTexture();												// デストラクタ
	static CBlackTexture * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);					// 初期化処理
	void Uninit(void);												// 終了処理
	void Update(void);												// プレイヤーの制御
	void Draw(void);												// 描画処理
private:
};
#endif
