//=============================================================================
//
// タイトルに戻るボタン [button_back_to_title.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "sound.h"
#include "button_back_to_title.h"
#include "texture.h"
#include "resource_manager.h"
#include "fade.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CBackToTitleButton::CBackToTitleButton()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBackToTitleButton::~CBackToTitleButton()
{
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CBackToTitleButton * CBackToTitleButton::Create(D3DXVECTOR3 Position, D3DXVECTOR3 SIze)
{
	//タイトルに戻るボタンのポインタ
	CBackToTitleButton * pBackToTitleButton = nullptr;
	//タイトルに戻るボタンのポインタがnullptrの場合
	if (pBackToTitleButton == nullptr)
	{
		//タイトルに戻るボタンのメモリ確保
		pBackToTitleButton = new CBackToTitleButton;
		//タイトルに戻るボタンのポインタがnullptrではない場合
		if (pBackToTitleButton != nullptr)
		{
			//タイトルに戻るボタンの初期化処理関数呼び出し
			pBackToTitleButton->Init(Position, SIze);
		}
	}
	//タイトルに戻るボタンのポインタを返す
	return pBackToTitleButton;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CBackToTitleButton::Init(D3DXVECTOR3 Position, D3DXVECTOR3 Size)
{
	CButton::Init(Position, Size);
	// テクスチャの設定
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_BUTTON_BACK_TO_TITLE));
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CBackToTitleButton::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CBackToTitleButton::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CBackToTitleButton::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CBackToTitleButton::Press(void)
{
	CScene::SetPause(false);
	// 遷移
	CFade *pFade = CManager::GetFade();
	pFade->SetFade(CManager::MODE_TYPE_TITLE);
}