//=============================================================================
//
// ボタン [button.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BUTTON_H_
#define _BUTTON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene_2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CButton :public CScene2D
{
public:
	typedef enum
	{
		BUTTON_SE_NONE = -1,
		BUTTON_SE_SELECT,
		BUTTON_SE_PUSH,
		BUTTON_SE_CANCEL,
		BUTTON_SE_MAX
	}BUTTON_SE;
	CButton(PRIORITY Priority = PRIORITY_BUTTON);
	~CButton();
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void ChangeTranslucent(bool bTranslucent);
	void PlayButtonSE(BUTTON_SE PlayButtonSE);
	virtual void Press(void) = 0;
private:
};
#endif