//=============================================================================
//
// 説明背景 [guid_bg.cpp]
// Author : 二階堂　汰一
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "resource_manager.h"
#include "texture.h"
#include "scene_2d.h"
#include "guid_bg.h"

//=============================================================================
// コンストラクタ
// Author : Nikaido Taichi
//=============================================================================
CGuidBG::CGuidBG(PRIORITY Priority) : CScene2D(Priority)
{
}

//=============================================================================
// デストラクタ
// Author : Nikaido Taichi
//=============================================================================
CGuidBG::~CGuidBG()
{
}

//=============================================================================
// 生成処理関数
// Author : Nikaido Taichi
//=============================================================================
CGuidBG * CGuidBG::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// CGuidBGのポインタ
	CGuidBG *pGuidBG = nullptr;

	// nullcheck
	if (pGuidBG == nullptr)
	{
		// メモリ確保
		pGuidBG = new CGuidBG;

		// !nullcheck
		if (pGuidBG != nullptr)
		{
			// 初期化処理
			pGuidBG->Init(pos, size);
		}
	}
	// ポインタを返す
	return pGuidBG;
}

//=============================================================================
// 初期化処理関数
// Author : Nikaido Taichi
//=============================================================================
HRESULT CGuidBG::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// シーン2Dの初期化処理関数呼び出し
	CScene2D::Init(pos, size);
	// テクスチャの設定
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_GUID_BG));
	return S_OK;
}

//=============================================================================
// 終了処理関数
// Author : Nikaido Taichi
//=============================================================================
void CGuidBG::Uninit(void)
{
	// シーン2Dの終了処理関数呼び出し
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理関数
// Author : Nikaido Taichi
//=============================================================================
void CGuidBG::Update(void)
{
	// シーン2Dの更新処理関数呼び出し
	CScene2D::Update();
}

//=============================================================================
// 描画処理関数
// Author : Nikaido Taichi
//=============================================================================
void CGuidBG::Draw(void)
{
	// シーン2Dの描画処理関数呼び出し
	CScene2D::Draw();
}
