#ifndef _ITEM_GET_UI_JAILER_KEY_H_
#define _ITEM_GET_UI_JAILER_KEY_H_
//=============================================================================
//
// プレイヤーUIクラスヘッダー [item_get_ui.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "item_get_ui.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CItemGetUIJailerKey: public CItemGetUI
{
public:
	CItemGetUIJailerKey();														// コンストラクタ
	~CItemGetUIJailerKey();														// デストラクタ
	static CItemGetUIJailerKey * Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Size);		// 生成処理
	HRESULT Init(D3DXVECTOR3 Pos, D3DXVECTOR3 Size);							// 初期化処理
	void Uninit(void);															// 終了処理
	void Draw(void);															// 描画処理
	void Update(void);															// プレイヤーの制御
private:
};
#endif
