//=============================================================================
//
// 看守状態クラス [jailer_state.cpp]
// Author : Yamada Ryota
//
//=============================================================================
#ifndef JAILER_STATE_H_
#define JAILER_STATE_H_

//=============================================================================
//マクロ定義
//=============================================================================
#define ADD_TIME (1)			//加算秒数

//=============================================================================
//前方宣言
//=============================================================================
class CJailer;
class CJailerView;

//=============================================================================
//クラス宣言
//=============================================================================
class CJailerState
{
public:
	//コンストラクタ
	CJailerState() {};
	//デストラクタ
	virtual ~CJailerState() {};
	//初期化
	virtual void Init(CJailer *pJailer, CJailerView *pJailerView) {};
	//更新
	virtual void Update(CJailer *pJailer, CJailerView *pJailerView) {};

private:
};

#endif // !STATE_H_
