//=============================================================================
//
// 看守階層用基底状態クラス [jailer_Hierachystate.cpp]
// Author : Yamada Ryota
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "jailer_return_routeState.h"
#include "jailer_AttackState.h"
#include "jailer.h"

//=============================================================================
//インスタンス生成関数
//=============================================================================
CAttackState * CAttackState::GetInstance()
{
	static CAttackState instance;
	return &instance;
}

//=============================================================================
//初期化関数
//=============================================================================
void CAttackState::Init(CJailer *pJailer, CJailerView *pJailerView)
{
	pJailer->SetTime(ZERO_INT);
}

//=============================================================================
//更新関数
//=============================================================================
void CAttackState::Update(CJailer *pJailer, CJailerView *pJailerView)
{
	if (pJailer->AddTime(1) >= 10)
	{
		pJailer->ChangeState(CReturnRouteState::GetInstance());
	}
}
