#ifndef _MAP_UI_TEXTURE_H_
#define _MAP_UI_TEXTURE_H_
//=============================================================================
//
// マップアイコンのテクスチャヘッダー [map_ui_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CMapUITexture : public CScene2D
{
public:
	CMapUITexture(PRIORITY Priority = PRIORITY_UI);					// コンストラクタ
	~CMapUITexture();													// デストラクタ
	static CMapUITexture * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);				// 初期化処理
	void Uninit(void);												// 終了処理
	void Update(void);												// プレイヤーの制御
	void Draw(void);												// 描画処理
private:
};
#endif
