//=============================================================================
//
// マップ説明テクスチャ [map_guid_texture.cpp]
// Author : 二階堂　汰一
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "map_guid_texture.h"
#include "texture.h"
#include "manager.h"
#include "resource_manager.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CMapGuidTexture::CMapGuidTexture(PRIORITY Priority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CMapGuidTexture::~CMapGuidTexture()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CMapGuidTexture * CMapGuidTexture::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// CMapGuidTextureのポインタ
	CMapGuidTexture *pMapGuidTexture = nullptr;

	// nullcheck
	if (pMapGuidTexture == nullptr)
	{
		// メモリ確保
		pMapGuidTexture = new CMapGuidTexture;

		// !nullcheck
		if (pMapGuidTexture != nullptr)
		{
			// 初期化処理
			pMapGuidTexture->Init(pos, size);
		}
	}
	// ポインタを返す
	return pMapGuidTexture;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CMapGuidTexture::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// シーン2Dの初期化処理関数呼び出し
	CScene2D::Init(pos, size);
	// テクスチャの設定
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_MAP_GUID));
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CMapGuidTexture::Uninit(void)
{
	// シーン2Dの終了処理関数呼び出し
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CMapGuidTexture::Update(void)
{
	// シーン2Dの更新処理関数呼び出し
	CScene2D::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CMapGuidTexture::Draw(void)
{
	// シーン2Dの描画処理関数呼び出し
	CScene2D::Draw();
}
