#ifndef _MODE_CLEAR_TIME_H_
#define _MODE_CLEAR_TIME_H_
//=============================================================================
//
// クリアタイムクラス [mode_clear_time.h]
// Author : Sugawara Tsukasa
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode_base.h"
#include "time.h"
//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CTime;
//=============================================================================
// クラス定義
//=============================================================================
class CMode_Clear_Time : public CModeBase
{
public:
	CMode_Clear_Time();			// コンストラクタ
	~CMode_Clear_Time();		// デストラクタ

	HRESULT Init(void);			// 初期化処理
	void Uninit(void);			// 終了処理
	void Update(void);			// 更新処理
	void Draw(void);			// 描画処理
	void ModeTransition(void);	// 遷移
	void ReadPlayerFile(void);	// プレイヤーのファイル読み込み
private:
	CTime *m_pTime;				// タイムのポインタ
	int m_nPlayerTime;			// プレイヤーのタイム
};
#endif