//=============================================================================
//
// 数字表示処理 [number.h]
// Author : 樋宮 匠
//
//=============================================================================

// 二重インクルード防止用
#ifndef _NUMBER_H_
#define _NUMBER_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene_2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_SIZE D3DXVECTOR3(50.0f, 85.0, 0.0f)

//*****************************************************************************
// 2Dポリゴンクラス定義
//*****************************************************************************
class CNumber : public CScene2D
{
public:
	// メンバ関数
	CNumber(PRIORITY = PRIORITY_UI);				// コンストラクタ
	~CNumber();										// デストラクタ
	HRESULT Init(D3DXVECTOR3 pos);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理
	static CNumber *Create(D3DXVECTOR3 pos);					// インスタンス生成
	void SetNumber(const int nNum);
	static void Unload(void);
private:
	// メンバ変数
	static LPDIRECT3DTEXTURE9		m_pTexture;		// テクスチャへのポインタ
	D3DXVECTOR3						m_pos;			// ポリゴンの位置
	int								m_nNumber;
};

#endif
