#ifndef _PAUSE_LOGO_TEXTURE_H_
#define _PAUSE_LOGO_TEXTURE_H_
//=============================================================================
//
// ポーズロゴテクスチャ [pause_logo_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CPauseLogoTexture : public CScene2D
{
public:
	CPauseLogoTexture(PRIORITY Priority = PRIORITY_TEXTURE);							// コンストラクタ
	~CPauseLogoTexture();														// デストラクタ
	static CPauseLogoTexture * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);		// 生成処理関数
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);							// 初期化処理
	void Uninit(void);															// 終了処理
	void Update(void);															// プレイヤーの制御
	void Draw(void);															// 描画処理
private:
};
#endif
