#ifndef _PC_ROOM_KEY_TEXTURE_H_
#define _PC_ROOM_KEY_TEXTURE_H_
//=============================================================================
//
// PC室鍵アイコンのテクスチャヘッダー [pc_room_key_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CPCRoomKeyTexture : public CScene2D
{
public:
	CPCRoomKeyTexture(PRIORITY Priority = PRIORITY_UI);						// コンストラクタ
	~CPCRoomKeyTexture();													// デストラクタ
	static CPCRoomKeyTexture * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 生成処理関数
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);						// 初期化処理
	void Uninit(void);														// 終了処理
	void Update(void);														// プレイヤーの制御
	void Draw(void);														// 描画処理
private:
};
#endif
