#ifndef _PLAYER2_UI_H_
#define _PLAYER2_UI_H_
//=============================================================================
//
// プレイヤー1UIクラスヘッダー [player2_ui.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "player_ui.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CItemObject;
class CScene2D;

//=============================================================================
// プレイヤークラス
//=============================================================================
class CPlayer2UI : public CPlayerUI
{
public:
	CPlayer2UI();		// コンストラクタ
	~CPlayer2UI();	// デストラクタ
	static CPlayer2UI * Create(void);
	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// プレイヤーの制御
private:
	void UICreate(void);
	int m_nItemTextureCount;
	CScene2D * m_apItemTexture[CItemObject::ITEM_OBJECT_MAX];
};
#endif
