#ifndef _PLAYER1_UI_H_
#define _PLAYER1_UI_H_
//=============================================================================
//
// プレイヤー1UIクラスヘッダー [player1_ui.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "player_ui.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;
class CSelectItemFlame;

//=============================================================================
// プレイヤークラス
//=============================================================================
class CPlayer1UI : public CPlayerUI
{
public:
	CPlayer1UI();												// コンストラクタ
	~CPlayer1UI();												// デストラクタ
	static CPlayer1UI * Create(void);
	HRESULT Init(void);											// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// プレイヤーの制御
private:
	void PlayerItemGet(void);											// 入力処理
	void UICreate(void);										// UI生成処理
	int m_nItemTextureCount;									// アイテムテクスチャ生成数
	int m_nSelectCount;											// アイテム選択のカウント
	CSelectItemFlame * m_pSelectItemFlame;						// アイテム選択枠のポインタ
	CScene2D * m_apItemTexture[CItemObject::ITEM_OBJECT_MAX];	// アイテムテクスチャのポインタ
};
#endif
