#ifndef _PLAYER_UI_MANAGER_H_
#define _PLAYER_UI_MANAGER_H_
//=============================================================================
//
// プレイヤーUIマネージャークラスヘッダー [player_ui_manager.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;

//=============================================================================
// プレイヤークラス
//=============================================================================
class CPlayerUIManager
{
public:
	CPlayerUIManager();		// コンストラクタ
	~CPlayerUIManager();	// デストラクタ
	static CPlayerUIManager * Create(void);
	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// プレイヤーの制御
private:
	void UICreate(void);
	int m_anItemTextureCount[2];
	CScene2D * m_apItemTexture[2][CItemObject::ITEM_OBJECT_MAX];
};
#endif
