//=============================================================================
// 順位 [rank.cpp]
// Author : SugawaraTsuksa
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ranking_bg.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"
#include "resource_manager.h"
//=============================================================================
// マクロ定義
// Author : SugawaraTsuksa
//=============================================================================
#define SIZE_VALUE	(D3DXVECTOR3(SCREEN_WIDTH,SCREEN_HEIGHT,0.0f))
//=============================================================================
// コンストラクタ
// Author : SugawaraTsuksa
//=============================================================================
CRanking_bg::CRanking_bg()
{
}

//=============================================================================
// デストラクタ
// Author : SugawaraTsuksa
//=============================================================================
CRanking_bg::~CRanking_bg()
{
}
//=============================================================================
// インスタンス生成処理
// Author : SugawaraTsuksa
//=============================================================================
CRanking_bg * CRanking_bg::Create(D3DXVECTOR3 pos)
{
	// CRanking_bgのポインタ
	CRanking_bg *pRank = nullptr;

	// nullptrの場合
	if (pRank == nullptr)
	{
		// メモリ確保
		pRank = new CRanking_bg;

		// !nullcheck
		if (pRank != nullptr)
		{
			pRank->Init(pos);
		}
	}
	// ポインタを返す
	return pRank;
}
//=============================================================================
// 初期化処理
// Author : SugawaraTsuksa
//=============================================================================
HRESULT CRanking_bg::Init(D3DXVECTOR3 pos)
{
	CScene2D::Init(pos, SIZE_VALUE);
	// テクスチャの設定
	CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();
	BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_RANKING_BG));

	return S_OK;
}

//=============================================================================
// 終了処理
// Author : SugawaraTsuksa
//=============================================================================
void CRanking_bg::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理
// Author : SugawaraTsuksa
//=============================================================================
void CRanking_bg::Update(void)
{
	CScene2D::Update();
}

//=============================================================================
// 描画処理
// Author : SugawaraTsuksa
//=============================================================================
void CRanking_bg::Draw(void)
{
	CScene2D::Draw();
}