//=============================================================================
//
// ランク [rank.h]
// Author : SugawaraTsukasa
//
//=============================================================================

// 二重インクルード防止用
#ifndef _RANKING_BG_H_
#define _RANKING_BG_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene_2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 2Dポリゴンクラス定義
//*****************************************************************************
class CRanking_bg : public CScene2D
{
public:
	// メンバ関数
	CRanking_bg();									// コンストラクタ
	~CRanking_bg();									// デストラクタ

	static CRanking_bg *Create(D3DXVECTOR3 pos);	// インスタンス生成
	HRESULT Init(D3DXVECTOR3 pos);					// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理
private:
};

#endif