#ifndef _SELECT_ITEM_FLAME_TEXTURE_H_
#define _SELECT_ITEM_FLAME_TEXTURE_H_
//=============================================================================
//
// 選択アイテムの枠 [ui_flame_texture.h]
// Author : Nikaido Taichi
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene_2d.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// プレイヤークラス
//=============================================================================
class CSelectItemFlame : public CScene2D
{
public:
	CSelectItemFlame(PRIORITY Priority = PRIORITY_UI);						// コンストラクタ
	~CSelectItemFlame();													// デストラクタ
	static CSelectItemFlame * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);						// 初期化処理
	void Uninit(void);														// 終了処理
	void Update(void);														// プレイヤーの制御
	void Draw(void);														// 描画処理
private:
};
#endif
