//=============================================================================
//
// タイトル処理 [title.cpp]
// Author : Sugawara Tsukasa
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "title.h"
#include "logo_title.h"
#include "bg_title.h"
#include "title_button_manager.h"
#include "fade.h"
//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// コンストラクタ
//=============================================================================
CTitle::CTitle()
{
	m_pTitleButtonManager = nullptr;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitle::~CTitle()
{
	// 終了処理
	Uninit();
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{
	// 生成処理関数呼び出し
	CreateAll();
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTitle::Uninit(void)
{

	if (m_pTitleButtonManager != nullptr)
	{
		// タイトルボタンマネージャーの終了処理関数呼び出し
		m_pTitleButtonManager->Uninit();
		m_pTitleButtonManager = nullptr;
	}

}

//=============================================================================
// 更新処理
//=============================================================================
void CTitle::Update(void)
{
	if (m_pTitleButtonManager != nullptr)
	{
		// タイトルボタンマネージャーの更新処理関数呼び出し
		m_pTitleButtonManager->Update();
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CTitle::Draw(void)
{
}
//=============================================================================
// 生成処理関数
//=============================================================================
void CTitle::CreateAll(void)
{
	CTitleBG::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f), D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f));
	CTitleLogo::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2 - 200.0f, 0.0f), D3DXVECTOR3(700.0f, 130.0f, 0.0f));
	if (m_pTitleButtonManager == nullptr)
	{
		// タイトルボタンマネージャーの生成
		m_pTitleButtonManager = CTitleButtonManager::Create();
	}
}


//=============================================================================
// モード遷移
//=============================================================================
void CTitle::ModeTransition(void)
{
	// 遷移
	CFade *pFade = CManager::GetFade();
	pFade->SetFade(CManager::MODE_TYPE_GAME);
}