#ifndef _TITLE_H_
#define _TITLE_H_
//=============================================================================
//
// タイトルクラス [title.h]
// Author : Sugawara Tsukasa
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode_base.h"
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CTitleButtonManager;

//=============================================================================
// クラス定義
//=============================================================================
class CTitle : public CModeBase
{
public:
	CTitle();					// コンストラクタ
	~CTitle();					// デストラクタ
	HRESULT Init(void);			// 初期化処理
	void Uninit(void);			// 終了処理
	void Update(void);			// 更新処理
	void Draw(void);			// 描画処理
private:
	void CreateAll(void);		// 生成処理関数
	void ModeTransition(CManager::MODE_TYPE mode);	// 遷移

	CTitleButtonManager *m_pTitleButtonManager;	// タイトルボタンマネージャーのポインタ
	int		m_nCountToMovie;		// 動画再生までの待機時間
};
#endif