#ifndef  _TUTORIAL_H_
#define  _TUTORIAL_H_
//=============================================================================
//
//  チュートリアルクラス [tutorial.h]
// Author : Sugawara Tsukasa
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode_base.h"

//=============================================================================
//前方宣言
//=============================================================================
class CScene2D;
class CKeyboardTexture;
class CPadTexture;
//=============================================================================
//クラス宣言
//=============================================================================
class CTutorial : public CModeBase
{
public:
	CTutorial();
	~CTutorial();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	CKeyboardTexture * m_pKeyboardTexture;
	CPadTexture * m_pPadTexture;
};

#endif // ! _TUTORIAL_H_

